<?php
    // Инициализация переменных
    $direction = 0;  // 0: направление неизвестно, 1: вверх, -1: вниз
    $changes = 0;    // Счетчик смен направления
    $new_direction = $direction;  // Новое направление
    print("Введите номера этажей, на которых останавливался лифт.\r\n");
    print("0 - конец ввода данных.\r\n");
    // Считываем первый этаж
    $prev = intval(fgets(STDIN));
    $b_done = ($prev == 0);  // флаговая переменная условие выхода из цикла
    while (!$b_done)
    {
        $current = intval(fgets(STDIN));  // Вводим остальные этажи
        $b_done = ($current == 0);  // Выходим из цикла, если введен 0
        // Если этажи совпадают, направление не меняется,
        // просто пропускаем
        if (!$b_done && $current != $prev)
        {
            // Определяем новое текущее направление
            // между prev и current
            $new_direction = 1;
            if ($current > $prev)
            {
                $new_direction = -1;
            }    
        }
        // Если до этого направление уже было известно (не 0)
        // и оно не совпадает с новым направлением, значит произошла смена
        if (!$b_done && $direction != 0 && $new_direction != $direction)
        {
            $changes += 1;
        }   
        // Обновляем историю для следующего шага
        $direction = $new_direction;
        $prev = $current;
    }
    print("Количество смен направления лифтом: " . $changes);
?>